/*
 * Do not edit.
 * Generated with `generate_models.py` on 2019-02-10 19:27:06.729035.
 * 308 bigram entries.
 * 963 ending entries.
 */

val PEOPLE_FEMALE_CYRILLIC = mapOf(
    Pair('а', Unit) to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('н', 'а') to arrayOf(
        Pair(Unit, 0.8814814814814815f),
        Pair('т', 0.037037037037037035f),
        Pair('р', 0.022222222222222223f),
        Pair('д', 0.022222222222222223f),
        Pair('и', 0.014814814814814815f),
        Pair('с', 0.014814814814814815f),
        Pair('н', 0.007407407407407408f)
    ),
    Pair('я', Unit) to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair(Unit, Unit) to arrayOf(
        Pair('а', 0.2146118721461187f),
        Pair('м', 0.1050228310502283f),
        Pair('в', 0.09817351598173515f),
        Pair('к', 0.07990867579908675f),
        Pair('д', 0.0776255707762557f),
        Pair('л', 0.06621004566210045f),
        Pair('г', 0.05251141552511415f),
        Pair('и', 0.0502283105022831f),
        Pair('з', 0.02968036529680365f),
        Pair('б', 0.0273972602739726f),
        Pair('н', 0.0273972602739726f),
        Pair('с', 0.0228310502283105f),
        Pair('о', 0.0182648401826484f),
        Pair('ю', 0.01598173515981735f),
        Pair('р', 0.01598173515981735f),
        Pair('е', 0.01598173515981735f),
        Pair('э', 0.0136986301369863f),
        Pair('я', 0.01141552511415525f),
        Pair('ф', 0.0091324200913242f),
        Pair('п', 0.0091324200913242f),
        Pair('т', 0.0091324200913242f),
        Pair('ж', 0.00684931506849315f),
        Pair('у', 0.00684931506849315f),
        Pair('х', 0.0045662100456621f),
        Pair('ш', 0.0045662100456621f),
        Pair('ц', 0.0045662100456621f),
        Pair('ч', 0.00228310502283105f)
    ),
    Pair('и', 'я') to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('и', 'н') to arrayOf(
        Pair('а', 0.8111111111111111f),
        Pair('ь', 0.03333333333333333f),
        Pair('о', 0.03333333333333333f),
        Pair('и', 0.03333333333333333f),
        Pair('е', 0.022222222222222223f),
        Pair('н', 0.022222222222222223f),
        Pair('э', 0.011111111111111112f),
        Pair('д', 0.011111111111111112f),
        Pair('г', 0.011111111111111112f),
        Pair(Unit, 0.011111111111111112f)
    ),
    Pair('р', 'а') to arrayOf(
        Pair(Unit, 0.8571428571428571f),
        Pair('и', 0.04081632653061224f),
        Pair('ф', 0.04081632653061224f),
        Pair('с', 0.02040816326530612f),
        Pair('д', 0.02040816326530612f),
        Pair('к', 0.02040816326530612f)
    ),
    Pair('т', 'а') to arrayOf(
        Pair(Unit, 0.76f),
        Pair('л', 0.1f),
        Pair('н', 0.06f),
        Pair('и', 0.02f),
        Pair('м', 0.02f),
        Pair('с', 0.02f),
        Pair('т', 0.02f)
    ),
    Pair('д', 'а') to arrayOf(
        Pair(Unit, 0.9f),
        Pair('н', 0.03333333333333333f),
        Pair('р', 0.03333333333333333f),
        Pair('л', 0.03333333333333333f)
    ),
    Pair(Unit, 'а') to arrayOf(
        Pair('н', 0.26595744680851063f),
        Pair('л', 0.1702127659574468f),
        Pair('г', 0.09574468085106383f),
        Pair('р', 0.0851063829787234f),
        Pair('в', 0.07446808510638298f),
        Pair('д', 0.07446808510638298f),
        Pair('п', 0.05319148936170213f),
        Pair('с', 0.0425531914893617f),
        Pair('з', 0.031914893617021274f),
        Pair('э', 0.02127659574468085f),
        Pair('к', 0.02127659574468085f),
        Pair('м', 0.02127659574468085f),
        Pair('ф', 0.02127659574468085f),
        Pair('я', 0.010638297872340425f),
        Pair('и', 0.010638297872340425f)
    ),
    Pair(Unit, 'м') to arrayOf(
        Pair('а', 0.5217391304347826f),
        Pair('и', 0.32608695652173914f),
        Pair('о', 0.06521739130434782f),
        Pair('е', 0.021739130434782608f),
        Pair('у', 0.021739130434782608f),
        Pair('л', 0.021739130434782608f),
        Pair('с', 0.021739130434782608f)
    ),
    Pair('в', 'а') to arrayOf(
        Pair(Unit, 0.5945945945945946f),
        Pair('с', 0.16216216216216217f),
        Pair('н', 0.10810810810810811f),
        Pair('л', 0.05405405405405406f),
        Pair('р', 0.05405405405405406f),
        Pair('ц', 0.02702702702702703f)
    ),
    Pair('л', 'и') to arrayOf(
        Pair('н', 0.2972972972972973f),
        Pair('я', 0.24324324324324326f),
        Pair('с', 0.06756756756756757f),
        Pair('а', 0.05405405405405406f),
        Pair('д', 0.05405405405405406f),
        Pair('м', 0.05405405405405406f),
        Pair('к', 0.05405405405405406f),
        Pair('л', 0.04054054054054054f),
        Pair('т', 0.04054054054054054f),
        Pair('в', 0.02702702702702703f),
        Pair('ц', 0.013513513513513514f),
        Pair('з', 0.013513513513513514f),
        Pair(Unit, 0.013513513513513514f),
        Pair('р', 0.013513513513513514f),
        Pair('б', 0.013513513513513514f)
    ),
    Pair('а', 'в') to arrayOf(
        Pair('а', 0.6129032258064516f),
        Pair('р', 0.16129032258064516f),
        Pair('д', 0.06451612903225806f),
        Pair('г', 0.06451612903225806f),
        Pair('е', 0.06451612903225806f),
        Pair('л', 0.03225806451612903f)
    ),
    Pair('а', 'л') to arrayOf(
        Pair('и', 0.41304347826086957f),
        Pair('е', 0.21739130434782608f),
        Pair('ь', 0.15217391304347827f),
        Pair('а', 0.08695652173913043f),
        Pair('л', 0.06521739130434782f),
        Pair('я', 0.021739130434782608f),
        Pair('о', 0.021739130434782608f),
        Pair('ф', 0.021739130434782608f)
    ),
    Pair('л', 'а') to arrayOf(
        Pair('в', 0.3050847457627119f),
        Pair(Unit, 0.288135593220339f),
        Pair('д', 0.11864406779661017f),
        Pair('н', 0.06779661016949153f),
        Pair('т', 0.05084745762711865f),
        Pair('р', 0.05084745762711865f),
        Pair('с', 0.03389830508474576f),
        Pair('г', 0.01694915254237288f),
        Pair('и', 0.01694915254237288f),
        Pair('у', 0.01694915254237288f),
        Pair('ф', 0.01694915254237288f),
        Pair('я', 0.01694915254237288f)
    ),
    Pair('а', 'р') to arrayOf(
        Pair('и', 0.3902439024390244f),
        Pair('а', 0.14634146341463414f),
        Pair('к', 0.07317073170731707f),
        Pair('т', 0.07317073170731707f),
        Pair('г', 0.04878048780487805f),
        Pair('ь', 0.04878048780487805f),
        Pair('л', 0.04878048780487805f),
        Pair('о', 0.024390243902439025f),
        Pair('е', 0.024390243902439025f),
        Pair('д', 0.024390243902439025f),
        Pair('с', 0.024390243902439025f),
        Pair('я', 0.024390243902439025f),
        Pair('в', 0.024390243902439025f),
        Pair('ф', 0.024390243902439025f)
    ),
    Pair('с', 'л') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair(Unit, 'д') to arrayOf(
        Pair('о', 0.47058823529411764f),
        Pair('и', 0.2647058823529412f),
        Pair('е', 0.11764705882352941f),
        Pair('у', 0.08823529411764706f),
        Pair('р', 0.029411764705882353f),
        Pair('а', 0.029411764705882353f)
    ),
    Pair('а', 'н') to arrayOf(
        Pair('а', 0.27586206896551724f),
        Pair('д', 0.15517241379310345f),
        Pair('н', 0.13793103448275862f),
        Pair('и', 0.13793103448275862f),
        Pair('ф', 0.06896551724137931f),
        Pair('е', 0.05172413793103448f),
        Pair('г', 0.05172413793103448f),
        Pair('т', 0.05172413793103448f),
        Pair('ж', 0.034482758620689655f),
        Pair('ь', 0.017241379310344827f),
        Pair('ц', 0.017241379310344827f)
    ),
    Pair('и', 'д') to arrayOf(
        Pair('а', 0.8f),
        Pair(Unit, 0.05f),
        Pair('и', 0.05f),
        Pair('о', 0.05f),
        Pair('е', 0.05f)
    ),
    Pair('и', 'р') to arrayOf(
        Pair('а', 0.625f),
        Pair('и', 0.16666666666666666f),
        Pair('о', 0.08333333333333333f),
        Pair('р', 0.041666666666666664f),
        Pair('м', 0.041666666666666664f),
        Pair('е', 0.041666666666666664f)
    ),
    Pair('м', 'а') to arrayOf(
        Pair('р', 0.38461538461538464f),
        Pair(Unit, 0.2564102564102564f),
        Pair('т', 0.07692307692307693f),
        Pair('л', 0.07692307692307693f),
        Pair('к', 0.05128205128205128f),
        Pair('и', 0.02564102564102564f),
        Pair('в', 0.02564102564102564f),
        Pair('н', 0.02564102564102564f),
        Pair('я', 0.02564102564102564f),
        Pair('й', 0.02564102564102564f),
        Pair('г', 0.02564102564102564f)
    ),
    Pair('е', 'л') to arrayOf(
        Pair('и', 0.4666666666666667f),
        Pair('а', 0.23333333333333334f),
        Pair('л', 0.13333333333333333f),
        Pair('ь', 0.1f),
        Pair('е', 0.06666666666666667f)
    ),
    Pair('с', 'а') to arrayOf(
        Pair(Unit, 0.7f),
        Pair('н', 0.25f),
        Pair('б', 0.05f)
    ),
    Pair(Unit, 'к') to arrayOf(
        Pair('а', 0.4f),
        Pair('и', 0.17142857142857143f),
        Pair('л', 0.14285714285714285f),
        Pair('о', 0.08571428571428572f),
        Pair('е', 0.08571428571428572f),
        Pair('с', 0.05714285714285714f),
        Pair('у', 0.02857142857142857f),
        Pair('р', 0.02857142857142857f)
    ),
    Pair('н', 'и') to arrayOf(
        Pair('я', 0.34146341463414637f),
        Pair('н', 0.21951219512195122f),
        Pair('к', 0.21951219512195122f),
        Pair('с', 0.12195121951219512f),
        Pair('д', 0.07317073170731707f),
        Pair('м', 0.024390243902439025f)
    ),
    Pair('о', 'н') to arrayOf(
        Pair('и', 0.5384615384615384f),
        Pair('а', 0.23076923076923078f),
        Pair('н', 0.07692307692307693f),
        Pair('к', 0.038461538461538464f),
        Pair('о', 0.038461538461538464f),
        Pair('с', 0.038461538461538464f),
        Pair('я', 0.038461538461538464f)
    ),
    Pair('к', 'а') to arrayOf(
        Pair(Unit, 0.40625f),
        Pair('л', 0.15625f),
        Pair('р', 0.09375f),
        Pair('м', 0.0625f),
        Pair('д', 0.0625f),
        Pair('з', 0.0625f),
        Pair('п', 0.03125f),
        Pair('с', 0.03125f),
        Pair('б', 0.03125f),
        Pair('н', 0.03125f),
        Pair('т', 0.03125f)
    ),
    Pair('е', 'н') to arrayOf(
        Pair('а', 0.4482758620689655f),
        Pair('и', 0.2413793103448276f),
        Pair('т', 0.10344827586206896f),
        Pair('е', 0.10344827586206896f),
        Pair('ц', 0.034482758620689655f),
        Pair('н', 0.034482758620689655f),
        Pair('р', 0.034482758620689655f)
    ),
    Pair('ь', 'я') to arrayOf(
        Pair(Unit, 0.8666666666666667f),
        Pair('н', 0.13333333333333333f)
    ),
    Pair(Unit, 'в') to arrayOf(
        Pair('и', 0.3023255813953488f),
        Pair('а', 0.27906976744186046f),
        Pair('е', 0.23255813953488372f),
        Pair('л', 0.13953488372093023f),
        Pair('о', 0.023255813953488372f),
        Pair('с', 0.023255813953488372f)
    ),
    Pair('и', 'к') to arrayOf(
        Pair('а', 0.631578947368421f),
        Pair('т', 0.21052631578947367f),
        Pair('и', 0.15789473684210525f)
    ),
    Pair('о', 'р') to arrayOf(
        Pair('а', 0.6f),
        Pair('и', 0.2f),
        Pair('д', 0.05f),
        Pair('г', 0.05f),
        Pair('о', 0.05f),
        Pair('н', 0.05f)
    ),
    Pair('р', 'и') to arrayOf(
        Pair('н', 0.27906976744186046f),
        Pair('а', 0.16279069767441862f),
        Pair('я', 0.16279069767441862f),
        Pair('с', 0.16279069767441862f),
        Pair('е', 0.046511627906976744f),
        Pair('д', 0.046511627906976744f),
        Pair('т', 0.046511627906976744f),
        Pair('э', 0.023255813953488372f),
        Pair('л', 0.023255813953488372f),
        Pair('м', 0.023255813953488372f),
        Pair('п', 0.023255813953488372f)
    ),
    Pair('н', 'н') to arrayOf(
        Pair('а', 0.8461538461538461f),
        Pair('е', 0.15384615384615385f)
    ),
    Pair('т', 'и') to arrayOf(
        Pair('н', 0.9166666666666666f),
        Pair('с', 0.08333333333333333f)
    ),
    Pair('м', 'и') to arrayOf(
        Pair('р', 0.3225806451612903f),
        Pair('л', 0.3225806451612903f),
        Pair('н', 0.1935483870967742f),
        Pair('х', 0.06451612903225806f),
        Pair('т', 0.03225806451612903f),
        Pair('я', 0.03225806451612903f),
        Pair('д', 0.03225806451612903f)
    ),
    Pair('е', 'я') to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair(Unit, 'г') to arrayOf(
        Pair('а', 0.43478260869565216f),
        Pair('е', 0.34782608695652173f),
        Pair('р', 0.13043478260869565f),
        Pair('о', 0.043478260869565216f),
        Pair('л', 0.043478260869565216f)
    ),
    Pair('г', 'а') to arrayOf(
        Pair('л', 0.5555555555555556f),
        Pair(Unit, 0.16666666666666666f),
        Pair('п', 0.1111111111111111f),
        Pair('т', 0.05555555555555555f),
        Pair('р', 0.05555555555555555f),
        Pair('ф', 0.05555555555555555f)
    ),
    Pair('л', 'е') to arrayOf(
        Pair('н', 0.3333333333333333f),
        Pair('о', 0.23333333333333334f),
        Pair('с', 0.13333333333333333f),
        Pair('к', 0.1f),
        Pair('р', 0.06666666666666667f),
        Pair('м', 0.03333333333333333f),
        Pair('т', 0.03333333333333333f),
        Pair('в', 0.03333333333333333f),
        Pair('я', 0.03333333333333333f)
    ),
    Pair('о', 'л') to arrayOf(
        Pair('и', 0.5263157894736842f),
        Pair('е', 0.15789473684210525f),
        Pair('ь', 0.10526315789473684f),
        Pair('л', 0.10526315789473684f),
        Pair('а', 0.05263157894736842f),
        Pair('я', 0.05263157894736842f)
    ),
    Pair('и', 'л') to arrayOf(
        Pair('и', 0.37037037037037035f),
        Pair('е', 0.14814814814814814f),
        Pair('ь', 0.1111111111111111f),
        Pair('о', 0.1111111111111111f),
        Pair('а', 0.1111111111111111f),
        Pair('л', 0.07407407407407407f),
        Pair('ю', 0.037037037037037035f),
        Pair('я', 0.037037037037037035f)
    ),
    Pair('и', 'т') to arrayOf(
        Pair('а', 0.8333333333333334f),
        Pair('о', 0.08333333333333333f),
        Pair('р', 0.08333333333333333f)
    ),
    Pair('а', 'т') to arrayOf(
        Pair('а', 0.5294117647058824f),
        Pair('р', 0.23529411764705882f),
        Pair('е', 0.11764705882352941f),
        Pair('ь', 0.058823529411764705f),
        Pair('о', 0.058823529411764705f)
    ),
    Pair('т', 'т') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('и', 'с') to arrayOf(
        Pair('а', 0.36f),
        Pair('л', 0.32f),
        Pair('и', 0.16f),
        Pair('т', 0.12f),
        Pair('ь', 0.04f)
    ),
    Pair('а', 'д') to arrayOf(
        Pair('и', 0.36363636363636365f),
        Pair('а', 0.2727272727272727f),
        Pair('е', 0.18181818181818182f),
        Pair('н', 0.045454545454545456f),
        Pair('л', 0.045454545454545456f),
        Pair('р', 0.045454545454545456f),
        Pair('о', 0.045454545454545456f)
    ),
    Pair('д', 'и') to arrayOf(
        Pair('я', 0.2962962962962963f),
        Pair('н', 0.2222222222222222f),
        Pair('к', 0.07407407407407407f),
        Pair('с', 0.07407407407407407f),
        Pair('о', 0.07407407407407407f),
        Pair('м', 0.037037037037037035f),
        Pair('л', 0.037037037037037035f),
        Pair('а', 0.037037037037037035f),
        Pair('т', 0.037037037037037035f),
        Pair('д', 0.037037037037037035f),
        Pair('ф', 0.037037037037037035f),
        Pair('г', 0.037037037037037035f)
    ),
    Pair('л', 'л') to arrayOf(
        Pair('а', 0.6153846153846154f),
        Pair('и', 0.3076923076923077f),
        Pair('о', 0.07692307692307693f)
    ),
    Pair(Unit, 'л') to arrayOf(
        Pair('и', 0.27586206896551724f),
        Pair('ю', 0.2413793103448276f),
        Pair('е', 0.20689655172413793f),
        Pair('а', 0.10344827586206896f),
        Pair('у', 0.10344827586206896f),
        Pair('о', 0.06896551724137931f)
    ),
    Pair('и', 'а') to arrayOf(
        Pair('н', 0.6153846153846154f),
        Pair('м', 0.15384615384615385f),
        Pair('д', 0.15384615384615385f),
        Pair('к', 0.07692307692307693f)
    ),
    Pair('а', 'с') to arrayOf(
        Pair('и', 0.4444444444444444f),
        Pair('т', 0.2777777777777778f),
        Pair('к', 0.05555555555555555f),
        Pair('с', 0.05555555555555555f),
        Pair('е', 0.05555555555555555f),
        Pair('м', 0.05555555555555555f),
        Pair('я', 0.05555555555555555f)
    ),
    Pair('д', 'о') to arrayOf(
        Pair('р', 0.2962962962962963f),
        Pair('м', 0.18518518518518517f),
        Pair('б', 0.14814814814814814f),
        Pair('с', 0.14814814814814814f),
        Pair('н', 0.07407407407407407f),
        Pair('т', 0.037037037037037035f),
        Pair('я', 0.037037037037037035f),
        Pair('л', 0.037037037037037035f),
        Pair('к', 0.037037037037037035f)
    ),
    Pair('с', 'т') to arrayOf(
        Pair('а', 0.4444444444444444f),
        Pair('и', 0.3888888888888889f),
        Pair('р', 0.1111111111111111f),
        Pair('е', 0.05555555555555555f)
    ),
    Pair('с', 'и') to arrayOf(
        Pair('я', 0.3333333333333333f),
        Pair('л', 0.23809523809523808f),
        Pair('н', 0.23809523809523808f),
        Pair('д', 0.09523809523809523f),
        Pair('ф', 0.047619047619047616f),
        Pair('м', 0.047619047619047616f)
    ),
    Pair('е', 'т') to arrayOf(
        Pair('т', 0.4666666666666667f),
        Pair('а', 0.4f),
        Pair('е', 0.06666666666666667f),
        Pair('л', 0.06666666666666667f)
    ),
    Pair('р', 'о') to arrayOf(
        Pair('н', 0.30434782608695654f),
        Pair('с', 0.21739130434782608f),
        Pair('з', 0.08695652173913043f),
        Pair('м', 0.08695652173913043f),
        Pair('д', 0.08695652173913043f),
        Pair('л', 0.043478260869565216f),
        Pair('г', 0.043478260869565216f),
        Pair('ф', 0.043478260869565216f),
        Pair('р', 0.043478260869565216f),
        Pair('п', 0.043478260869565216f)
    ),
    Pair('в', 'л') to arrayOf(
        Pair('а', 0.8571428571428571f),
        Pair('и', 0.14285714285714285f)
    ),
    Pair('з', 'а') to arrayOf(
        Pair(Unit, 0.4f),
        Pair('р', 0.26666666666666666f),
        Pair('л', 0.2f),
        Pair('в', 0.06666666666666667f),
        Pair('б', 0.06666666666666667f)
    ),
    Pair('и', 'м') to arrayOf(
        Pair('а', 0.5f),
        Pair('и', 0.25f),
        Pair('п', 0.16666666666666666f),
        Pair('м', 0.08333333333333333f)
    ),
    Pair(Unit, 'н') to arrayOf(
        Pair('а', 0.5f),
        Pair('и', 0.25f),
        Pair('о', 0.16666666666666666f),
        Pair('е', 0.08333333333333333f)
    ),
    Pair('г', 'е') to arrayOf(
        Pair('н', 0.3333333333333333f),
        Pair('л', 0.3333333333333333f),
        Pair('р', 0.2f),
        Pair('я', 0.06666666666666667f),
        Pair('о', 0.06666666666666667f)
    ),
    Pair(Unit, 'б') to arrayOf(
        Pair('е', 0.4166666666666667f),
        Pair('о', 0.4166666666666667f),
        Pair('л', 0.08333333333333333f),
        Pair('р', 0.08333333333333333f)
    ),
    Pair(Unit, 'о') to arrayOf(
        Pair('л', 0.625f),
        Pair('к', 0.25f),
        Pair('ф', 0.125f)
    ),
    Pair('к', 'и') to arrayOf(
        Pair('р', 0.4166666666666667f),
        Pair('я', 0.4166666666666667f),
        Pair('м', 0.08333333333333333f),
        Pair('л', 0.08333333333333333f)
    ),
    Pair('б', 'р') to arrayOf(
        Pair('о', 0.625f),
        Pair('и', 0.375f)
    ),
    Pair('о', 'м') to arrayOf(
        Pair('и', 0.5555555555555556f),
        Pair('н', 0.4444444444444444f)
    ),
    Pair(Unit, 'з') to arrayOf(
        Pair('а', 0.38461538461538464f),
        Pair('и', 0.38461538461538464f),
        Pair('л', 0.07692307692307693f),
        Pair('е', 0.07692307692307693f),
        Pair('о', 0.07692307692307693f)
    ),
    Pair('к', 'с') to arrayOf(
        Pair('и', 0.5f),
        Pair('а', 0.4f),
        Pair('е', 0.1f)
    ),
    Pair('ь', Unit) to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('с', 'я') to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('в', 'е') to arrayOf(
        Pair('т', 0.29411764705882354f),
        Pair('л', 0.23529411764705882f),
        Pair('н', 0.17647058823529413f),
        Pair('р', 0.17647058823529413f),
        Pair('с', 0.11764705882352941f)
    ),
    Pair(Unit, 'и') to arrayOf(
        Pair('р', 0.22727272727272727f),
        Pair('в', 0.18181818181818182f),
        Pair('н', 0.13636363636363635f),
        Pair('з', 0.13636363636363635f),
        Pair('л', 0.09090909090909091f),
        Pair('д', 0.09090909090909091f),
        Pair('о', 0.045454545454545456f),
        Pair('с', 0.045454545454545456f),
        Pair('я', 0.045454545454545456f)
    ),
    Pair('н', 'д') to arrayOf(
        Pair('р', 0.5f),
        Pair('а', 0.2f),
        Pair('и', 0.2f),
        Pair('ж', 0.1f)
    ),
    Pair('л', 'ь') to arrayOf(
        Pair('в', 0.23529411764705882f),
        Pair('б', 0.17647058823529413f),
        Pair('г', 0.11764705882352941f),
        Pair(Unit, 0.11764705882352941f),
        Pair('я', 0.11764705882352941f),
        Pair('и', 0.058823529411764705f),
        Pair('м', 0.058823529411764705f),
        Pair('д', 0.058823529411764705f),
        Pair('ф', 0.058823529411764705f)
    ),
    Pair('ь', 'в') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('в', 'и') to arrayOf(
        Pair('я', 0.19047619047619047f),
        Pair('т', 0.19047619047619047f),
        Pair('л', 0.19047619047619047f),
        Pair('к', 0.14285714285714285f),
        Pair('н', 0.09523809523809523f),
        Pair('о', 0.09523809523809523f),
        Pair('г', 0.047619047619047616f),
        Pair('р', 0.047619047619047616f)
    ),
    Pair('к', 'л') to arrayOf(
        Pair('а', 0.5714285714285714f),
        Pair('е', 0.2857142857142857f),
        Pair('и', 0.14285714285714285f)
    ),
    Pair('с', 'с') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('н', 'е') to arrayOf(
        Pair('т', 0.2857142857142857f),
        Pair('с', 0.21428571428571427f),
        Pair('л', 0.21428571428571427f),
        Pair('д', 0.14285714285714285f),
        Pair('в', 0.07142857142857142f),
        Pair('р', 0.07142857142857142f)
    ),
    Pair('о', 'с') to arrayOf(
        Pair('л', 0.4f),
        Pair('и', 0.3f),
        Pair('ь', 0.1f),
        Pair('а', 0.1f),
        Pair('я', 0.1f)
    ),
    Pair('е', 'с') to arrayOf(
        Pair('л', 0.3076923076923077f),
        Pair('с', 0.23076923076923078f),
        Pair('я', 0.15384615384615385f),
        Pair('т', 0.15384615384615385f),
        Pair('е', 0.07692307692307693f),
        Pair('м', 0.07692307692307693f)
    ),
    Pair('о', 'б') to arrayOf(
        Pair('р', 1.0f)
    ),
    Pair('и', 'з') to arrayOf(
        Pair('а', 0.6666666666666666f),
        Pair('и', 0.16666666666666666f),
        Pair('о', 0.16666666666666666f)
    ),
    Pair('н', 'ф') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('ф', 'и') to arrayOf(
        Pair('я', 0.36363636363636365f),
        Pair('р', 0.18181818181818182f),
        Pair('м', 0.18181818181818182f),
        Pair('с', 0.09090909090909091f),
        Pair('п', 0.09090909090909091f),
        Pair('н', 0.09090909090909091f)
    ),
    Pair('е', 'р') to arrayOf(
        Pair('т', 0.23529411764705882f),
        Pair('а', 0.23529411764705882f),
        Pair('и', 0.17647058823529413f),
        Pair('о', 0.11764705882352941f),
        Pair('м', 0.058823529411764705f),
        Pair('ь', 0.058823529411764705f),
        Pair('к', 0.058823529411764705f),
        Pair('е', 0.058823529411764705f)
    ),
    Pair('я', 'н') to arrayOf(
        Pair('а', 0.8f),
        Pair('и', 0.2f)
    ),
    Pair('е', 'о') to arrayOf(
        Pair('н', 0.5f),
        Pair('к', 0.25f),
        Pair('п', 0.125f),
        Pair('р', 0.125f)
    ),
    Pair('а', 'г') to arrayOf(
        Pair('а', 0.36363636363636365f),
        Pair('н', 0.18181818181818182f),
        Pair('р', 0.18181818181818182f),
        Pair('е', 0.09090909090909091f),
        Pair('д', 0.09090909090909091f),
        Pair('л', 0.09090909090909091f)
    ),
    Pair('о', 'д') to arrayOf(
        Pair('о', 0.6666666666666666f),
        Pair('е', 0.16666666666666666f),
        Pair('и', 0.16666666666666666f)
    ),
    Pair('а', 'и') to arrayOf(
        Pair('д', 0.4444444444444444f),
        Pair('с', 0.3333333333333333f),
        Pair('н', 0.2222222222222222f)
    ),
    Pair('а', 'м') to arrayOf(
        Pair('а', 0.5714285714285714f),
        Pair('н', 0.14285714285714285f),
        Pair(Unit, 0.14285714285714285f),
        Pair('и', 0.14285714285714285f)
    ),
    Pair('л', 'ю') to arrayOf(
        Pair('б', 0.5f),
        Pair('ц', 0.25f),
        Pair('т', 0.125f),
        Pair('д', 0.125f)
    ),
    Pair('ж', 'е') to arrayOf(
        Pair('л', 0.75f),
        Pair('н', 0.25f)
    ),
    Pair('л', 'я') to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair(Unit, 'ф') to arrayOf(
        Pair('е', 0.75f),
        Pair('а', 0.25f)
    ),
    Pair('у', 'с') to arrayOf(
        Pair('т', 0.6f),
        Pair('а', 0.2f),
        Pair('я', 0.2f)
    ),
    Pair('д', 'е') to arrayOf(
        Pair('л', 0.3f),
        Pair('н', 0.1f),
        Pair('ж', 0.1f),
        Pair('с', 0.1f),
        Pair('б', 0.1f),
        Pair('к', 0.1f),
        Pair('и', 0.1f),
        Pair('я', 0.1f)
    ),
    Pair('а', 'к') to arrayOf(
        Pair('с', 0.5f),
        Pair('и', 0.16666666666666666f),
        Pair('у', 0.16666666666666666f),
        Pair('р', 0.16666666666666666f)
    ),
    Pair('н', 'ь') to arrayOf(
        Pair('я', 0.75f),
        Pair(Unit, 0.25f)
    ),
    Pair('б', 'е') to arrayOf(
        Pair('р', 0.375f),
        Pair('л', 0.25f),
        Pair('а', 0.25f),
        Pair('н', 0.125f)
    ),
    Pair('е', 'в') to arrayOf(
        Pair('а', 0.5f),
        Pair('т', 0.16666666666666666f),
        Pair('г', 0.16666666666666666f),
        Pair('д', 0.16666666666666666f)
    ),
    Pair('р', 'ь') to arrayOf(
        Pair('я', 1.0f)
    ),
    Pair('н', 'г') to arrayOf(
        Pair('е', 0.75f),
        Pair('а', 0.25f)
    ),
    Pair(Unit, 'т') to arrayOf(
        Pair('а', 0.75f),
        Pair('е', 0.25f)
    ),
    Pair('ф', 'е') to arrayOf(
        Pair('я', 0.375f),
        Pair('д', 0.25f),
        Pair('к', 0.125f),
        Pair('л', 0.125f),
        Pair('н', 0.125f)
    ),
    Pair('м', 'н') to arrayOf(
        Pair('и', 0.6f),
        Pair('а', 0.4f)
    ),
    Pair('з', 'и') to arrayOf(
        Pair('н', 0.42857142857142855f),
        Pair('г', 0.2857142857142857f),
        Pair('д', 0.14285714285714285f),
        Pair('м', 0.14285714285714285f)
    ),
    Pair('ю', 'б') to arrayOf(
        Pair('о', 0.75f),
        Pair('а', 0.25f)
    ),
    Pair('с', 'е') to arrayOf(
        Pair('н', 0.5f),
        Pair('л', 0.16666666666666666f),
        Pair('р', 0.16666666666666666f),
        Pair('с', 0.16666666666666666f)
    ),
    Pair('р', 'е') to arrayOf(
        Pair('н', 0.25f),
        Pair('л', 0.16666666666666666f),
        Pair('т', 0.16666666666666666f),
        Pair('я', 0.16666666666666666f),
        Pair('м', 0.08333333333333333f),
        Pair('г', 0.08333333333333333f),
        Pair('з', 0.08333333333333333f)
    ),
    Pair(Unit, 'э') to arrayOf(
        Pair('л', 0.5f),
        Pair('м', 0.3333333333333333f),
        Pair('в', 0.16666666666666666f)
    ),
    Pair('р', 'т') to arrayOf(
        Pair('а', 0.42857142857142855f),
        Pair('е', 0.2857142857142857f),
        Pair('и', 0.14285714285714285f),
        Pair('р', 0.14285714285714285f)
    ),
    Pair(Unit, 'е') to arrayOf(
        Pair('в', 0.42857142857142855f),
        Pair('л', 0.2857142857142857f),
        Pair('ф', 0.14285714285714285f),
        Pair('к', 0.14285714285714285f)
    ),
    Pair('н', 'т') to arrayOf(
        Pair('о', 0.5f),
        Pair('и', 0.3333333333333333f),
        Pair('е', 0.16666666666666666f)
    ),
    Pair('т', 'о') to arrayOf(
        Pair('н', 0.42857142857142855f),
        Pair('л', 0.2857142857142857f),
        Pair('р', 0.2857142857142857f)
    ),
    Pair('а', 'я') to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('е', 'к') to arrayOf(
        Pair('с', 0.5f),
        Pair('а', 0.3333333333333333f),
        Pair('л', 0.16666666666666666f)
    ),
    Pair('д', 'р') to arrayOf(
        Pair('о', 0.42857142857142855f),
        Pair('и', 0.2857142857142857f),
        Pair('а', 0.14285714285714285f),
        Pair('е', 0.14285714285714285f)
    ),
    Pair('п', 'о') to arrayOf(
        Pair('л', 1.0f)
    ),
    Pair(Unit, 'с') to arrayOf(
        Pair('о', 0.3f),
        Pair('т', 0.2f),
        Pair('и', 0.1f),
        Pair('в', 0.1f),
        Pair('у', 0.1f),
        Pair('а', 0.1f),
        Pair('е', 0.1f)
    ),
    Pair(Unit, 'ж') to arrayOf(
        Pair('а', 0.6666666666666666f),
        Pair('о', 0.3333333333333333f)
    ),
    Pair('т', 'р') to arrayOf(
        Pair('а', 0.25f),
        Pair('о', 0.25f),
        Pair('и', 0.25f),
        Pair('е', 0.125f),
        Pair('у', 0.125f)
    ),
    Pair(Unit, 'р') to arrayOf(
        Pair('о', 0.2857142857142857f),
        Pair('е', 0.2857142857142857f),
        Pair('и', 0.2857142857142857f),
        Pair('а', 0.14285714285714285f)
    ),
    Pair('о', 'з') to arrayOf(
        Pair('а', 0.6666666666666666f),
        Pair('е', 0.3333333333333333f)
    ),
    Pair('т', 'е') to arrayOf(
        Pair('я', 0.25f),
        Pair('р', 0.25f),
        Pair('м', 0.25f),
        Pair('в', 0.125f),
        Pair('п', 0.125f)
    ),
    Pair('в', 'р') to arrayOf(
        Pair('е', 0.4f),
        Pair('о', 0.4f),
        Pair('а', 0.2f)
    ),
    Pair('и', 'е') to arrayOf(
        Pair('т', 1.0f)
    ),
    Pair('н', 'ж') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair('е', 'д') to arrayOf(
        Pair('и', 0.5f),
        Pair('о', 0.5f)
    ),
    Pair('к', 'т') to arrayOf(
        Pair('а', 0.4f),
        Pair('о', 0.4f),
        Pair('я', 0.2f)
    ),
    Pair('а', 'э') to arrayOf(
        Pair('л', 1.0f)
    ),
    Pair('э', 'л') to arrayOf(
        Pair('л', 0.4f),
        Pair('ь', 0.2f),
        Pair('и', 0.2f),
        Pair('е', 0.2f)
    ),
    Pair('в', 'г') to arrayOf(
        Pair('у', 0.6666666666666666f),
        Pair('е', 0.3333333333333333f)
    ),
    Pair('г', 'у') to arrayOf(
        Pair('с', 1.0f)
    ),
    Pair('и', 'х') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair(Unit, 'ю') to arrayOf(
        Pair('л', 0.2857142857142857f),
        Pair('н', 0.2857142857142857f),
        Pair('р', 0.14285714285714285f),
        Pair('с', 0.14285714285714285f),
        Pair('д', 0.14285714285714285f)
    ),
    Pair('ю', 'л') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('у', 'л') to arrayOf(
        Pair('и', 0.6666666666666666f),
        Pair('ь', 0.3333333333333333f)
    ),
    Pair('п', 'р') to arrayOf(
        Pair('а', 0.6666666666666666f),
        Pair('е', 0.3333333333333333f)
    ),
    Pair('о', 'в') to arrayOf(
        Pair('ь', 0.6666666666666666f),
        Pair('и', 0.3333333333333333f)
    ),
    Pair('а', 'п') to arrayOf(
        Pair('и', 0.25f),
        Pair('р', 0.25f),
        Pair('о', 0.25f),
        Pair('а', 0.125f),
        Pair('ф', 0.125f)
    ),
    Pair('я', 'б') to arrayOf(
        Pair('р', 1.0f)
    ),
    Pair('к', 'о') to arrayOf(
        Pair('н', 0.4f),
        Pair('р', 0.4f),
        Pair('в', 0.2f)
    ),
    Pair('р', 'д') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('г', 'р') to arrayOf(
        Pair('а', 0.3333333333333333f),
        Pair('е', 0.3333333333333333f),
        Pair('и', 0.3333333333333333f)
    ),
    Pair('ь', 'б') to arrayOf(
        Pair('е', 0.6666666666666666f),
        Pair('и', 0.3333333333333333f)
    ),
    Pair('л', 'о') to arrayOf(
        Pair('л', 0.25f),
        Pair('н', 0.25f),
        Pair('с', 0.125f),
        Pair('и', 0.125f),
        Pair('т', 0.125f),
        Pair('р', 0.125f)
    ),
    Pair('г', 'н') to arrayOf(
        Pair('е', 0.5f),
        Pair('и', 0.25f),
        Pair('а', 0.25f)
    ),
    Pair('б', 'о') to arrayOf(
        Pair('р', 0.2222222222222222f),
        Pair('м', 0.2222222222222222f),
        Pair('я', 0.1111111111111111f),
        Pair('ж', 0.1111111111111111f),
        Pair('в', 0.1111111111111111f),
        Pair('г', 0.1111111111111111f),
        Pair('л', 0.1111111111111111f)
    ),
    Pair('с', 'ь') to arrayOf(
        Pair('я', 1.0f)
    ),
    Pair(Unit, 'я') to arrayOf(
        Pair('н', 0.4f),
        Pair('д', 0.2f),
        Pair('с', 0.2f),
        Pair('р', 0.2f)
    ),
    Pair('п', 'а') to arrayOf(
        Pair(Unit, 0.3333333333333333f),
        Pair('в', 0.3333333333333333f),
        Pair('т', 0.16666666666666666f),
        Pair('н', 0.16666666666666666f)
    ),
    Pair('в', 'д') to arrayOf(
        Pair('о', 0.6666666666666666f),
        Pair('и', 0.3333333333333333f)
    ),
    Pair('т', 'ь') to arrayOf(
        Pair('я', 1.0f)
    ),
    Pair('к', 'р') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('и', 'в') to arrayOf(
        Pair('и', 0.3333333333333333f),
        Pair('а', 0.3333333333333333f),
        Pair('е', 0.16666666666666666f),
        Pair('о', 0.16666666666666666f)
    ),
    Pair('м', 'м') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('о', 'ф') to arrayOf(
        Pair('е', 0.5f),
        Pair('ь', 0.25f),
        Pair('и', 0.25f)
    ),
    Pair('а', 'з') to arrayOf(
        Pair('а', 0.4f),
        Pair('е', 0.2f),
        Pair('д', 0.2f),
        Pair('и', 0.2f)
    ),
    Pair('н', 'я') to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('н', 'о') to arrayOf(
        Pair('н', 0.2857142857142857f),
        Pair('р', 0.2857142857142857f),
        Pair('я', 0.14285714285714285f),
        Pair('д', 0.14285714285714285f),
        Pair('в', 0.14285714285714285f)
    ),
    Pair('р', 'к') to arrayOf(
        Pair('а', 0.5f),
        Pair('с', 0.25f),
        Pair('и', 0.25f)
    ),
    Pair('г', 'и') to arrayOf(
        Pair('н', 1.0f)
    ),
    Pair(Unit, 'ц') to arrayOf(
        Pair('в', 1.0f)
    ),
    Pair('ц', 'в') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair('о', 'к') to arrayOf(
        Pair('а', 0.4f),
        Pair('т', 0.2f),
        Pair('с', 0.2f),
        Pair('и', 0.2f)
    ),
    Pair('р', 'м') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('о', 'я') to arrayOf(
        Pair(Unit, 0.5f),
        Pair('б', 0.25f),
        Pair('н', 0.25f)
    ),
    Pair('и', 'о') to arrayOf(
        Pair('д', 0.3333333333333333f),
        Pair('л', 0.3333333333333333f),
        Pair('а', 0.16666666666666666f),
        Pair('н', 0.16666666666666666f)
    ),
    Pair('м', 'п') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('и', 'п') to arrayOf(
        Pair('п', 1.0f)
    ),
    Pair('е', 'а') to arrayOf(
        Pair('т', 1.0f)
    ),
    Pair('ф', 'ь') to arrayOf(
        Pair('я', 0.6666666666666666f),
        Pair(Unit, 0.3333333333333333f)
    ),
    Pair('к', 'е') to arrayOf(
        Pair('р', 0.5f),
        Pair('т', 0.25f),
        Pair('л', 0.25f)
    ),
    Pair('ю', 'ц') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('ц', 'и') to arrayOf(
        Pair('я', 0.6666666666666666f),
        Pair('н', 0.3333333333333333f)
    ),
    Pair('с', 'м') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('б', 'и') to arrayOf(
        Pair('н', 1.0f)
    ),
    Pair('ф', 'р') to arrayOf(
        Pair('о', 1.0f)
    ),
    Pair('с', 'о') to arrayOf(
        Pair('ф', 0.6666666666666666f),
        Pair('н', 0.3333333333333333f)
    ),
    Pair('г', 'д') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('а', 'ф') to arrayOf(
        Pair('и', 0.3333333333333333f),
        Pair('ь', 0.16666666666666666f),
        Pair('р', 0.16666666666666666f),
        Pair('а', 0.16666666666666666f),
        Pair('е', 0.16666666666666666f)
    ),
    Pair('п', 'и') to arrayOf(
        Pair('я', 0.3333333333333333f),
        Pair('т', 0.16666666666666666f),
        Pair('а', 0.16666666666666666f),
        Pair('о', 0.16666666666666666f),
        Pair('н', 0.16666666666666666f)
    ),
    Pair(Unit, 'у') to arrayOf(
        Pair('л', 0.6666666666666666f),
        Pair('с', 0.3333333333333333f)
    ),
    Pair('г', 'л') to arrayOf(
        Pair('а', 0.6666666666666666f),
        Pair('и', 0.3333333333333333f)
    ),
    Pair('е', 'м') to arrayOf(
        Pair('и', 0.4f),
        Pair('а', 0.2f),
        Pair('ф', 0.2f),
        Pair('е', 0.2f)
    ),
    Pair('ж', 'а') to arrayOf(
        Pair('н', 0.5f),
        Pair('с', 0.5f)
    ),
    Pair('з', 'л') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('ю', 'р') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('д', 'н') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('р', 'г') to arrayOf(
        Pair('е', 0.3333333333333333f),
        Pair('и', 0.3333333333333333f),
        Pair('а', 0.3333333333333333f)
    ),
    Pair('ь', 'г') to arrayOf(
        Pair('а', 0.5f),
        Pair('е', 0.5f)
    ),
    Pair('м', 'о') to arrayOf(
        Pair('и', 0.3333333333333333f),
        Pair('д', 0.3333333333333333f),
        Pair('н', 0.3333333333333333f)
    ),
    Pair('о', 'и') to arrayOf(
        Pair('к', 0.5f),
        Pair('з', 0.5f)
    ),
    Pair('н', 'ц') to arrayOf(
        Pair('е', 0.5f),
        Pair('и', 0.5f)
    ),
    Pair('ц', 'е') to arrayOf(
        Pair('с', 1.0f)
    ),
    Pair('х', 'а') to arrayOf(
        Pair('й', 0.3333333333333333f),
        Pair('в', 0.3333333333333333f),
        Pair('л', 0.3333333333333333f)
    ),
    Pair('а', 'й') to arrayOf(
        Pair('л', 0.5f),
        Pair('я', 0.5f)
    ),
    Pair('й', 'л') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair(Unit, 'х') to arrayOf(
        Pair('р', 0.5f),
        Pair('а', 0.5f)
    ),
    Pair('х', 'р') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('ь', 'и') to arrayOf(
        Pair('н', 1.0f)
    ),
    Pair('и', 'ц') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('ц', 'а') to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('к', 'у') to arrayOf(
        Pair('л', 0.5f),
        Pair('п', 0.5f)
    ),
    Pair('ю', 'н') to arrayOf(
        Pair('и', 0.5f),
        Pair('о', 0.5f)
    ),
    Pair(Unit, 'п') to arrayOf(
        Pair('р', 0.25f),
        Pair('е', 0.25f),
        Pair('а', 0.25f),
        Pair('о', 0.25f)
    ),
    Pair('с', 'к') to arrayOf(
        Pair('о', 1.0f)
    ),
    Pair('в', 'ь') to arrayOf(
        Pair('я', 0.5f),
        Pair(Unit, 0.5f)
    ),
    Pair('н', 'к') to arrayOf(
        Pair('о', 1.0f)
    ),
    Pair('я', 'д') to arrayOf(
        Pair('в', 1.0f)
    ),
    Pair('д', 'в') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('и', 'г') to arrayOf(
        Pair('а', 0.25f),
        Pair('л', 0.25f),
        Pair('р', 0.25f),
        Pair('н', 0.25f)
    ),
    Pair('о', 'ж') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair('о', 'г') to arrayOf(
        Pair('н', 0.5f),
        Pair('д', 0.5f)
    ),
    Pair('э', 'м') to arrayOf(
        Pair('и', 0.5f),
        Pair('м', 0.5f)
    ),
    Pair('и', 'э') to arrayOf(
        Pair('т', 1.0f)
    ),
    Pair('э', 'т') to arrayOf(
        Pair('т', 1.0f)
    ),
    Pair('с', 'в') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair('т', 'л') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('и', 'ф') to arrayOf(
        Pair('е', 0.5f),
        Pair('ь', 0.5f)
    ),
    Pair('м', Unit) to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('ь', 'м') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('ю', 'т') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('т', 'я') to arrayOf(
        Pair('б', 1.0f)
    ),
    Pair('д', 'ж') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair('о', 'п') to arrayOf(
        Pair('а', 0.5f),
        Pair('и', 0.5f)
    ),
    Pair('з', 'о') to arrayOf(
        Pair('л', 0.5f),
        Pair('я', 0.5f)
    ),
    Pair('ь', 'д') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('б', 'л') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('о', 'т') to arrayOf(
        Pair('ь', 0.5f),
        Pair('т', 0.5f)
    ),
    Pair(Unit, 'ш') to arrayOf(
        Pair('у', 0.5f),
        Pair('а', 0.5f)
    ),
    Pair('ш', 'у') to arrayOf(
        Pair('ш', 1.0f)
    ),
    Pair('у', 'ш') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('ш', 'а') to arrayOf(
        Pair('н', 0.5f),
        Pair('р', 0.5f)
    ),
    Pair('ф', 'а') to arrayOf(
        Pair('и', 0.3333333333333333f),
        Pair('н', 0.3333333333333333f),
        Pair(Unit, 0.3333333333333333f)
    ),
    Pair('д', Unit) to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('я', 'с') to arrayOf(
        Pair('н', 1.0f)
    ),
    Pair('с', 'н') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('з', 'е') to arrayOf(
        Pair('м', 0.3333333333333333f),
        Pair('л', 0.3333333333333333f),
        Pair('ф', 0.3333333333333333f)
    ),
    Pair('м', 'ф') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('у', 'п') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('д', 'у') to arrayOf(
        Pair('н', 0.3333333333333333f),
        Pair('с', 0.3333333333333333f),
        Pair('к', 0.3333333333333333f)
    ),
    Pair('у', 'н') to arrayOf(
        Pair('я', 0.5f),
        Pair('а', 0.5f)
    ),
    Pair('п', 'е') to arrayOf(
        Pair('л', 1.0f)
    ),
    Pair('р', 'л') to arrayOf(
        Pair('о', 0.5f),
        Pair('е', 0.5f)
    ),
    Pair('а', 'б') to arrayOf(
        Pair('е', 0.3333333333333333f),
        Pair('р', 0.3333333333333333f),
        Pair('и', 0.3333333333333333f)
    ),
    Pair('е', 'ж') to arrayOf(
        Pair('д', 1.0f)
    ),
    Pair('ж', 'д') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('с', 'у') to arrayOf(
        Pair('с', 1.0f)
    ),
    Pair('е', 'п') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('о', 'а') to arrayOf(
        Pair('н', 1.0f)
    ),
    Pair('н', 'э') to arrayOf(
        Pair('р', 1.0f)
    ),
    Pair('э', 'р') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('л', 'у') to arrayOf(
        Pair('и', 0.3333333333333333f),
        Pair('к', 0.3333333333333333f),
        Pair('н', 0.3333333333333333f)
    ),
    Pair('у', 'и') to arrayOf(
        Pair('з', 1.0f)
    ),
    Pair('б', 'а') to arrayOf(
        Pair('в', 0.5f),
        Pair(Unit, 0.5f)
    ),
    Pair('е', 'б') to arrayOf(
        Pair('о', 1.0f)
    ),
    Pair('м', 'е') to arrayOf(
        Pair('л', 0.5f),
        Pair('н', 0.5f)
    ),
    Pair('и', Unit) to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('п', 'п') to arrayOf(
        Pair('а', 0.5f),
        Pair('и', 0.5f)
    ),
    Pair('ж', 'о') to arrayOf(
        Pair('з', 1.0f)
    ),
    Pair('е', 'ф') to arrayOf(
        Pair('и', 0.5f),
        Pair('р', 0.5f)
    ),
    Pair('э', 'в') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair('ь', 'ф') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('й', 'я') to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('л', 'ф') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair('п', 'ф') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('в', 'т') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('р', 'с') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair(Unit, 'ч') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair('ч', 'е') to arrayOf(
        Pair('с', 1.0f)
    ),
    Pair('м', 'у') to arrayOf(
        Pair('з', 1.0f)
    ),
    Pair('у', 'з') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('у', 'к') to arrayOf(
        Pair('е', 0.5f),
        Pair('л', 0.5f)
    ),
    Pair('ю', 'с') to arrayOf(
        Pair('т', 1.0f)
    ),
    Pair('а', 'ц') to arrayOf(
        Pair('л', 1.0f)
    ),
    Pair('ц', 'л') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('в', 'о') to arrayOf(
        Pair('л', 0.5f),
        Pair('н', 0.5f)
    ),
    Pair('м', 'л') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('з', 'д') to arrayOf(
        Pair('о', 1.0f)
    ),
    Pair('а', 'у') to arrayOf(
        Pair('р', 1.0f)
    ),
    Pair('у', 'р') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('н', 'р') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('р', 'я') to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('н', Unit) to arrayOf(
        Pair(Unit, 1.0f)
    ),
    Pair('р', 'н') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair('р', 'в') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('я', 'р') to arrayOf(
        Pair('о', 1.0f)
    ),
    Pair('е', 'и') to arrayOf(
        Pair('н', 1.0f)
    ),
    Pair('д', 'л') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair('г', 'о') to arrayOf(
        Pair('р', 1.0f)
    ),
    Pair('р', 'р') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('н', 'с') to arrayOf(
        Pair('т', 1.0f)
    ),
    Pair('ю', 'д') to arrayOf(
        Pair('и', 0.5f),
        Pair('м', 0.5f)
    ),
    Pair('м', 'с') to arrayOf(
        Pair('т', 1.0f)
    ),
    Pair('е', 'г') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('р', 'у') to arrayOf(
        Pair('д', 1.0f)
    ),
    Pair('у', 'д') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('е', 'з') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('в', 'с') to arrayOf(
        Pair('е', 1.0f)
    ),
    Pair('д', 'м') to arrayOf(
        Pair('и', 1.0f)
    ),
    Pair('и', 'б') to arrayOf(
        Pair('а', 1.0f)
    ),
    Pair('р', 'ф') to arrayOf(
        Pair('а', 1.0f)
    )
)
